zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3u1xx/SI32_SIM3U1XX_PBCFG_A_Registers.h
#define SI32_PBCFG_A_CONTROL1_MATMD_MASK  0x00030000
#define SI32_PBCFG_A_CONTROL1_MATMD_SHIFT  16
// Port Match registers used to provide interrupt / wake sources.
#define SI32_PBCFG_A_CONTROL1_MATMD_PINMATCH_VALUE  0
#define SI32_PBCFG_A_CONTROL1_MATMD_PINMATCH_U32 \
   (SI32_PBCFG_A_CONTROL1_MATMD_PINMATCH_VALUE << SI32_PBCFG_A_CONTROL1_MATMD_SHIFT)
// Port Match registers used to monitor output pin activity for Capacitive Sensing
// measurements.
#define SI32_PBCFG_A_CONTROL1_MATMD_CAPSENSE_TX_VALUE  1
#define SI32_PBCFG_A_CONTROL1_MATMD_CAPSENSE_TX_U32 \
   (SI32_PBCFG_A_CONTROL1_MATMD_CAPSENSE_TX_VALUE << SI32_PBCFG_A_CONTROL1_MATMD_SHIFT)
// Port Match registers used to monitor input pin activity for Capacitive Sensing
// measurements.
#define SI32_PBCFG_A_CONTROL1_MATMD_CAPSENSE_RX_VALUE  2
#define SI32_PBCFG_A_CONTROL1_MATMD_CAPSENSE_RX_U32 \
   (SI32_PBCFG_A_CONTROL1_MATMD_CAPSENSE_RX_VALUE << SI32_PBCFG_A_CONTROL1_MATMD_SHIFT)

#define SI32_PBCFG_A_CONTROL1_EVREGRMD_MASK  0x00800000
#define SI32_PBCFG_A_CONTROL1_EVREGRMD_SHIFT  23
// The pins used by the external regulator will default to digital inputs with weak
// pull-up enabled on any reset.
#define SI32_PBCFG_A_CONTROL1_EVREGRMD_RESET_ON_ANY_VALUE  0
#define SI32_PBCFG_A_CONTROL1_EVREGRMD_RESET_ON_ANY_U32 \
   (SI32_PBCFG_A_CONTROL1_EVREGRMD_RESET_ON_ANY_VALUE << SI32_PBCFG_A_CONTROL1_EVREGRMD_SHIFT)
// The pins used by the external regulator will default to digital inputs with weak
// pull-up enabled only on Power-On Reset. Their configured mode will be preserved
// through all other resets.
#define SI32_PBCFG_A_CONTROL1_EVREGRMD_RESET_ON_POR_VALUE  1
#define SI32_PBCFG_A_CONTROL1_EVREGRMD_RESET_ON_POR_U32 \
   (SI32_PBCFG_A_CONTROL1_EVREGRMD_RESET_ON_POR_VALUE << SI32_PBCFG_A_CONTROL1_EVREGRMD_SHIFT)

#define SI32_PBCFG_A_CONTROL1_LOCK_MASK  0x80000000
#define SI32_PBCFG_A_CONTROL1_LOCK_SHIFT  31
// Port Bank Configuration and Control registers are unlocked.
#define SI32_PBCFG_A_CONTROL1_LOCK_UNLOCKED_VALUE  0U
#define SI32_PBCFG_A_CONTROL1_LOCK_UNLOCKED_U32 \
   (SI32_PBCFG_A_CONTROL1_LOCK_UNLOCKED_VALUE << SI32_PBCFG_A_CONTROL1_LOCK_SHIFT)
// The following registers are locked from write access: CONTROL1, XBAR0L, XBAR0H,
// XBAR1, and all PBSKIP registers.
#define SI32_PBCFG_A_CONTROL1_LOCK_LOCKED_VALUE  1U
#define SI32_PBCFG_A_CONTROL1_LOCK_LOCKED_U32 \
   (SI32_PBCFG_A_CONTROL1_LOCK_LOCKED_VALUE << SI32_PBCFG_A_CONTROL1_LOCK_SHIFT)



struct SI32_PBCFG_A_XBAR0L_Struct
{
   union
   {
      struct
      {
         // USART0 Enable
         volatile uint32_t USART0EN: 1;
         // USART0 Flow Control Enable
         volatile uint32_t USART0FCEN: 1;
         // USART0 Clock Signal Enable
         volatile uint32_t USART0CEN: 1;
         // SPI0 Enable
         volatile uint32_t SPI0EN: 1;
         // SPI0 NSS Pin Enable
         volatile uint32_t SPI0NSSEN: 1;
         // USART1 Enable
         volatile uint32_t USART1EN: 1;
         // USART1 Flow Control Enable
         volatile uint32_t USART1FCEN: 1;
         // USART1 Clock Signal Enable
         volatile uint32_t USART1CEN: 1;
         // EPCA0 Channel Enable
         volatile uint32_t EPCA0EN: 3;
                  uint32_t reserved0: 3;
         // PCA0 Channel Enable
         volatile uint32_t PCA0EN: 2;
         // PCA1 Channel Enable
         volatile uint32_t PCA1EN: 2;
         // EPCA0 ECI Enable
         volatile uint32_t EECI0EN: 1;
         // PCA0 ECI Enable
         volatile uint32_t ECI0EN: 1;
         // PCA1 ECI Enable
         volatile uint32_t ECI1EN: 1;
         // I2S0 TX Enable
         volatile uint32_t I2S0TXEN: 1;
         // I2C0 Enable
         volatile uint32_t I2C0EN: 1;
         // Comparator 0 Synchronous Output (CMP0S) Enable
         volatile uint32_t CMP0SEN: 1;
         // Comparator 0 Asynchronous Output (CMP0A) Enable
         volatile uint32_t CMP0AEN: 1;
         // Comparator 1 Synchronous Output (CMP1S) Enable
         volatile uint32_t CMP1SEN: 1;
         // Comparator 1 Asynchronous Output (CMP1A) Enable
         volatile uint32_t CMP1AEN: 1;
         // TIMER0 T0CT Enable
         volatile uint32_t TMR0CTEN: 1;
         // TIMER0 T0EX Enable
         volatile uint32_t TMR0EXEN: 1;
         // TIMER1 T1CT Enable
         volatile uint32_t TMR1CTEN: 1;
         // TIMER1 T1EX Enable
         volatile uint32_t TMR1EXEN: 1;
                  uint32_t reserved1: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBCFG_A_XBAR0L_USART0EN_MASK  0x00000001
#define SI32_PBCFG_A_XBAR0L_USART0EN_SHIFT  0
// Disable USART0 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_USART0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART0EN_SHIFT)
// Enable USART0 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_USART0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_USART0FCEN_MASK  0x00000002
#define SI32_PBCFG_A_XBAR0L_USART0FCEN_SHIFT  1
// Disable USART0 flow control on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART0FCEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_USART0FCEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART0FCEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART0FCEN_SHIFT)
// Enable USART0 flow control on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART0FCEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_USART0FCEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART0FCEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART0FCEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_USART0CEN_MASK  0x00000004
#define SI32_PBCFG_A_XBAR0L_USART0CEN_SHIFT  2
// Disable USART0 clock on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART0CEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_USART0CEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART0CEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART0CEN_SHIFT)
// Enable USART0 clock on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART0CEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_USART0CEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART0CEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART0CEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_SPI0EN_MASK  0x00000008
#define SI32_PBCFG_A_XBAR0L_SPI0EN_SHIFT  3
// Disable SPI0 SCK, MISO, and MOSI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_SPI0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_SPI0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_SPI0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_SPI0EN_SHIFT)
// Enable SPI0 SCK, MISO, and MOSI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_SPI0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_SPI0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_SPI0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_SPI0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_SPI0NSSEN_MASK  0x00000010
#define SI32_PBCFG_A_XBAR0L_SPI0NSSEN_SHIFT  4
// Disable SPI0 NSS on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_SPI0NSSEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_SPI0NSSEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_SPI0NSSEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_SPI0NSSEN_SHIFT)
// Enable SPI0 NSS on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_SPI0NSSEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_SPI0NSSEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_SPI0NSSEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_SPI0NSSEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_USART1EN_MASK  0x00000020
#define SI32_PBCFG_A_XBAR0L_USART1EN_SHIFT  5
// Disable USART1 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_USART1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART1EN_SHIFT)
// Enable USART1 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_USART1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART1EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_USART1FCEN_MASK  0x00000040
#define SI32_PBCFG_A_XBAR0L_USART1FCEN_SHIFT  6
// Disable USART1 flow control on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART1FCEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_USART1FCEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART1FCEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART1FCEN_SHIFT)
// Enable USART1 flow control on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART1FCEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_USART1FCEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART1FCEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART1FCEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_USART1CEN_MASK  0x00000080
#define SI32_PBCFG_A_XBAR0L_USART1CEN_SHIFT  7
// Disable USART1 clock on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART1CEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_USART1CEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART1CEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART1CEN_SHIFT)
// Enable USART1 clock on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_USART1CEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_USART1CEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_USART1CEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_USART1CEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_EPCA0EN_MASK  0x00000700
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_SHIFT  8
// Disable all EPCA0 channels on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_NONE_VALUE  0
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_NONE_U32 \
   (SI32_PBCFG_A_XBAR0L_EPCA0EN_NONE_VALUE << SI32_PBCFG_A_XBAR0L_EPCA0EN_SHIFT)
// Enable EPCA0 STD_CEX0 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_VALUE  1
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_U32 \
   (SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_VALUE << SI32_PBCFG_A_XBAR0L_EPCA0EN_SHIFT)
// Enable EPCA0 STD_CEX0 and STD_CEX1 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_1_VALUE  2
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_1_U32 \
   (SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_1_VALUE << SI32_PBCFG_A_XBAR0L_EPCA0EN_SHIFT)
// Enable EPCA0 STD_CEX0, STD_CEX1, and STD_CEX2 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_2_VALUE  3
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_2_U32 \
   (SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_2_VALUE << SI32_PBCFG_A_XBAR0L_EPCA0EN_SHIFT)
// Enable EPCA0 STD_CEX0, STD_CEX1, STD_CEX2, and STD_CEX3 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_3_VALUE  4
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_3_U32 \
   (SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_3_VALUE << SI32_PBCFG_A_XBAR0L_EPCA0EN_SHIFT)
// Enable EPCA0 STD_CEX0, STD_CEX1, STD_CEX2, STD_CEX3, and STD_CEX4 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_4_VALUE  5
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_4_U32 \
   (SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_4_VALUE << SI32_PBCFG_A_XBAR0L_EPCA0EN_SHIFT)
// Enable EPCA0 STD_CEX0, STD_CEX1, STD_CEX2, STD_CEX3, STD_CEX4, and STD_CEX5 on
// Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_5_VALUE  6
#define SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_5_U32 \
   (SI32_PBCFG_A_XBAR0L_EPCA0EN_STD_CEX0_5_VALUE << SI32_PBCFG_A_XBAR0L_EPCA0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_PCA0EN_MASK  0x0000C000
#define SI32_PBCFG_A_XBAR0L_PCA0EN_SHIFT  14
// Disable all PCA0 channels on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_PCA0EN_NONE_VALUE  0
#define SI32_PBCFG_A_XBAR0L_PCA0EN_NONE_U32 \
   (SI32_PBCFG_A_XBAR0L_PCA0EN_NONE_VALUE << SI32_PBCFG_A_XBAR0L_PCA0EN_SHIFT)
// Enable PCA0 CEX0 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_PCA0EN_CEX0_VALUE  1
#define SI32_PBCFG_A_XBAR0L_PCA0EN_CEX0_U32 \
   (SI32_PBCFG_A_XBAR0L_PCA0EN_CEX0_VALUE << SI32_PBCFG_A_XBAR0L_PCA0EN_SHIFT)
// Enable PCA0 CEX0 and CEX1 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_PCA0EN_CEX0_1_VALUE  3
#define SI32_PBCFG_A_XBAR0L_PCA0EN_CEX0_1_U32 \
   (SI32_PBCFG_A_XBAR0L_PCA0EN_CEX0_1_VALUE << SI32_PBCFG_A_XBAR0L_PCA0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_PCA1EN_MASK  0x00030000
#define SI32_PBCFG_A_XBAR0L_PCA1EN_SHIFT  16
// Disable all PCA1 channels on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_PCA1EN_NONE_VALUE  0
#define SI32_PBCFG_A_XBAR0L_PCA1EN_NONE_U32 \
   (SI32_PBCFG_A_XBAR0L_PCA1EN_NONE_VALUE << SI32_PBCFG_A_XBAR0L_PCA1EN_SHIFT)
// Enable PCA1 CEX0 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_PCA1EN_CEX0_VALUE  1
#define SI32_PBCFG_A_XBAR0L_PCA1EN_CEX0_U32 \
   (SI32_PBCFG_A_XBAR0L_PCA1EN_CEX0_VALUE << SI32_PBCFG_A_XBAR0L_PCA1EN_SHIFT)
// Enable PCA1 CEX0 and CEX1 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_PCA1EN_CEX0_1_VALUE  3
#define SI32_PBCFG_A_XBAR0L_PCA1EN_CEX0_1_U32 \
   (SI32_PBCFG_A_XBAR0L_PCA1EN_CEX0_1_VALUE << SI32_PBCFG_A_XBAR0L_PCA1EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_EECI0EN_MASK  0x00040000
#define SI32_PBCFG_A_XBAR0L_EECI0EN_SHIFT  18
// Disable EPCA0 ECI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_EECI0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_EECI0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_EECI0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_EECI0EN_SHIFT)
// Enable EPCA0 ECI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_EECI0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_EECI0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_EECI0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_EECI0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_ECI0EN_MASK  0x00080000
#define SI32_PBCFG_A_XBAR0L_ECI0EN_SHIFT  19
// Disable PCA0 ECI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_ECI0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_ECI0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_ECI0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_ECI0EN_SHIFT)
// Enable PCA0 ECI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_ECI0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_ECI0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_ECI0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_ECI0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_ECI1EN_MASK  0x00100000
#define SI32_PBCFG_A_XBAR0L_ECI1EN_SHIFT  20
// Disable PCA1 ECI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_ECI1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_ECI1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_ECI1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_ECI1EN_SHIFT)
// Enable PCA1 ECI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_ECI1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_ECI1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_ECI1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_ECI1EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_I2S0TXEN_MASK  0x00200000
#define SI32_PBCFG_A_XBAR0L_I2S0TXEN_SHIFT  21
// Disable I2S0 TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_I2S0TXEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_I2S0TXEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_I2S0TXEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_I2S0TXEN_SHIFT)
// Enable I2S0 TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_I2S0TXEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_I2S0TXEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_I2S0TXEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_I2S0TXEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_I2C0EN_MASK  0x00400000
#define SI32_PBCFG_A_XBAR0L_I2C0EN_SHIFT  22
// Disable I2C0 SDA and SCL on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_I2C0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_I2C0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_I2C0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_I2C0EN_SHIFT)
// Enable I2C0 SDA and SCL on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_I2C0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_I2C0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_I2C0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_I2C0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_CMP0SEN_MASK  0x00800000
#define SI32_PBCFG_A_XBAR0L_CMP0SEN_SHIFT  23
// Disable Comparator 0 Synchronous Output (CMP0S) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_CMP0SEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_CMP0SEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_CMP0SEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_CMP0SEN_SHIFT)
// Enable Comparator 0 Synchronous Output (CMP0S) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_CMP0SEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_CMP0SEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_CMP0SEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_CMP0SEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_CMP0AEN_MASK  0x01000000
#define SI32_PBCFG_A_XBAR0L_CMP0AEN_SHIFT  24
// Disable Comparator 0 Asynchronous Output (CMP0A) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_CMP0AEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_CMP0AEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_CMP0AEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_CMP0AEN_SHIFT)
// Enable Comparator 0 Asynchronous Output (CMP0A) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_CMP0AEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_CMP0AEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_CMP0AEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_CMP0AEN_SHIFT)

#define SI32_PBCFG_A_XBAR0L_CMP1SEN_MASK  0x02000000
#define SI32_PBCFG_A_XBAR0L_CMP1SEN_SHIFT  25
// Disable Comparator 1 Synchronous Output (CMP1S) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_CMP1SEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0L_CMP1SEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_CMP1SEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0L_CMP1SEN_SHIFT)
// Enable Comparator 1 Synchronous Output (CMP1S) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0L_CMP1SEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0L_CMP1SEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0L_CMP1SEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0L_CMP1SEN_SHIFT)

