zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3u1xx/SI32_SIM3U1XX_PBCFG_A_Registers.h
#define SI32_PBCFG_A_XBAR0H_SPI2EN_MASK  0x00000020
#define SI32_PBCFG_A_XBAR0H_SPI2EN_SHIFT  5
// Disable SPI2 SCK, MISO, and MOSI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_SPI2EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0H_SPI2EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_SPI2EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0H_SPI2EN_SHIFT)
// Enable SPI2 SCK, MISO, and MOSI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_SPI2EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0H_SPI2EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_SPI2EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0H_SPI2EN_SHIFT)

#define SI32_PBCFG_A_XBAR0H_SPI2NSSEN_MASK  0x00000040
#define SI32_PBCFG_A_XBAR0H_SPI2NSSEN_SHIFT  6
// Disable SPI2 NSS on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_SPI2NSSEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0H_SPI2NSSEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_SPI2NSSEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0H_SPI2NSSEN_SHIFT)
// Enable SPI2 NSS on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_SPI2NSSEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0H_SPI2NSSEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_SPI2NSSEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0H_SPI2NSSEN_SHIFT)

#define SI32_PBCFG_A_XBAR0H_AHBEN_MASK  0x00000080
#define SI32_PBCFG_A_XBAR0H_AHBEN_SHIFT  7
// Disable the AHB Clock / 16 output on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_AHBEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0H_AHBEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_AHBEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0H_AHBEN_SHIFT)
// Enable the AHB Clock / 16 output on Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_AHBEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0H_AHBEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_AHBEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0H_AHBEN_SHIFT)

#define SI32_PBCFG_A_XBAR0H_XBAR0EN_MASK  0x80000000
#define SI32_PBCFG_A_XBAR0H_XBAR0EN_SHIFT  31
// Disable Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_XBAR0EN_DISABLED_VALUE  0U
#define SI32_PBCFG_A_XBAR0H_XBAR0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_XBAR0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0H_XBAR0EN_SHIFT)
// Enable Crossbar 0.
#define SI32_PBCFG_A_XBAR0H_XBAR0EN_ENABLED_VALUE  1U
#define SI32_PBCFG_A_XBAR0H_XBAR0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0H_XBAR0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0H_XBAR0EN_SHIFT)



struct SI32_PBCFG_A_XBAR1_Struct
{
   union
   {
      struct
      {
         // SSG0 Enable
         volatile uint32_t SSG0EN: 2;
         // Comparator 0 Synchronous Output (CMP0S) Enable
         volatile uint32_t CMP0SEN: 1;
         // Comparator 1 Synchronous Output (CMP1S) Enable
         volatile uint32_t CMP1SEN: 1;
         // SPI1 Enable
         volatile uint32_t SPI1EN: 1;
         // SPI1 NSS Pin Enable
         volatile uint32_t SPI1NSSEN: 1;
         // RTC0 Output Enable
         volatile uint32_t RTC0EN: 1;
         // SPI2 Enable
         volatile uint32_t SPI2EN: 1;
         // SPI2 NSS Pin Enable
         volatile uint32_t SPI2NSSEN: 1;
         // USART1 Enable
         volatile uint32_t USART1EN: 1;
         // USART1 Flow Control Enable
         volatile uint32_t USART1FCEN: 1;
         // USART1 Clock Signal Enable
         volatile uint32_t USART1CEN: 1;
         // UART0 Enable
         volatile uint32_t UART0EN: 1;
         // UART0 Flow Control Enable
         volatile uint32_t UART0FCEN: 1;
         // I2S0 TX Enable
         volatile uint32_t I2S0TXEN: 1;
         // I2C0 Enable
         volatile uint32_t I2C0EN: 1;
         // UART1 Enable
         volatile uint32_t UART1EN: 1;
         // I2S0 RX Enable
         volatile uint32_t I2S0RXEN: 1;
                  uint32_t reserved0: 1;
         // LPTIMER0 Output Enable
         volatile uint32_t LPT0OEN: 1;
         // I2C1 Enable
         volatile uint32_t I2C1EN: 1;
         // High Drive Kill Pin Enable
         volatile uint32_t KILLHDEN: 1;
                  uint32_t reserved1: 9;
         // Crossbar 1 Enable
         volatile uint32_t XBAR1EN: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBCFG_A_XBAR1_SSG0EN_MASK  0x00000003
#define SI32_PBCFG_A_XBAR1_SSG0EN_SHIFT  0
// Disable all SSG0 channels on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SSG0EN_NONE_VALUE  0
#define SI32_PBCFG_A_XBAR1_SSG0EN_NONE_U32 \
   (SI32_PBCFG_A_XBAR1_SSG0EN_NONE_VALUE << SI32_PBCFG_A_XBAR1_SSG0EN_SHIFT)
// Enable SSG0 EX0 on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SSG0EN_EX0_VALUE  1
#define SI32_PBCFG_A_XBAR1_SSG0EN_EX0_U32 \
   (SI32_PBCFG_A_XBAR1_SSG0EN_EX0_VALUE << SI32_PBCFG_A_XBAR1_SSG0EN_SHIFT)
// Enable SSG0 EX0 and EX1 on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SSG0EN_EX0_1_VALUE  2
#define SI32_PBCFG_A_XBAR1_SSG0EN_EX0_1_U32 \
   (SI32_PBCFG_A_XBAR1_SSG0EN_EX0_1_VALUE << SI32_PBCFG_A_XBAR1_SSG0EN_SHIFT)
// Enable SSG0 EX0, EX1, EX2, and EX3 on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SSG0EN_EX0_3_VALUE  3
#define SI32_PBCFG_A_XBAR1_SSG0EN_EX0_3_U32 \
   (SI32_PBCFG_A_XBAR1_SSG0EN_EX0_3_VALUE << SI32_PBCFG_A_XBAR1_SSG0EN_SHIFT)

#define SI32_PBCFG_A_XBAR1_CMP0SEN_MASK  0x00000004
#define SI32_PBCFG_A_XBAR1_CMP0SEN_SHIFT  2
// Disable Comparator 0 Synchronous Output (CMP0S) on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_CMP0SEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_CMP0SEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_CMP0SEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_CMP0SEN_SHIFT)
// Enable Comparator 0 Synchronous Output (CMP0S) on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_CMP0SEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_CMP0SEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_CMP0SEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_CMP0SEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_CMP1SEN_MASK  0x00000008
#define SI32_PBCFG_A_XBAR1_CMP1SEN_SHIFT  3
// Disable Comparator 1 Synchronous Output (CMP1S) on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_CMP1SEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_CMP1SEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_CMP1SEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_CMP1SEN_SHIFT)
// Enable Comparator 1 Synchronous Output (CMP1S) on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_CMP1SEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_CMP1SEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_CMP1SEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_CMP1SEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_SPI1EN_MASK  0x00000010
#define SI32_PBCFG_A_XBAR1_SPI1EN_SHIFT  4
// Disable SPI1 SCK, MISO, and MOSI on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SPI1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_SPI1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_SPI1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_SPI1EN_SHIFT)
// Enable SPI1 SCK, MISO, and MOSI on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SPI1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_SPI1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_SPI1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_SPI1EN_SHIFT)

#define SI32_PBCFG_A_XBAR1_SPI1NSSEN_MASK  0x00000020
#define SI32_PBCFG_A_XBAR1_SPI1NSSEN_SHIFT  5
// Disable SPI1 NSS on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SPI1NSSEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_SPI1NSSEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_SPI1NSSEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_SPI1NSSEN_SHIFT)
// Enable SPI1 NSS on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_SPI1NSSEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_SPI1NSSEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_SPI1NSSEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_SPI1NSSEN_SHIFT)

#define SI32_PBCFG_A_XBAR1_RTC0EN_MASK  0x00000040
#define SI32_PBCFG_A_XBAR1_RTC0EN_SHIFT  6
// Disable RTC0 Output on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_RTC0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR1_RTC0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR1_RTC0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR1_RTC0EN_SHIFT)
// Enable RTC0 Output on Crossbar 1.
#define SI32_PBCFG_A_XBAR1_RTC0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR1_RTC0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR1_RTC0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR1_RTC0EN_SHIFT)

